results/unused/fabio-512-run03/003_fio/cmd_51.output
io_uring-bdev_xnvme: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk_bdev, iodepth=128
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666794349,
  "timestamp_ms" : 1666794349085,
  "time" : "Wed Oct 26 16:25:49 2022",
  "jobs" : [
    {
      "jobname" : "io_uring-bdev_xnvme",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring-bdev_xnvme",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "128",
        "bs" : "512",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "spdk_bdev",
        "spdk_conf" : "/tmp/spdk_bdev_xnvme_io_uring.conf",
        "filename" : "Nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 1622561280,
        "io_kbytes" : 1584532,
        "bw_bytes" : 231761359,
        "bw" : 226329,
        "iops" : 452640.622768,
        "runtime" : 7001,
        "total_ios" : 3168937,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1582,
          "max" : 17573,
          "mean" : 1749.826342,
          "stddev" : 232.494994,
          "N" : 3168938
        },
        "clat_ns" : {
          "min" : 9849,
          "max" : 308709,
          "mean" : 280714.433041,
          "stddev" : 4668.783657,
          "N" : 3169064,
          "percentile" : {
            "1.000000" : 276480,
            "5.000000" : 276480,
            "10.000000" : 276480,
            "20.000000" : 276480,
            "30.000000" : 276480,
            "40.000000" : 280576,
            "50.000000" : 280576,
            "60.000000" : 280576,
            "70.000000" : 280576,
            "80.000000" : 280576,
            "90.000000" : 288768,
            "95.000000" : 292864,
            "99.000000" : 292864,
            "99.500000" : 296960,
            "99.900000" : 301056,
            "99.950000" : 305152,
            "99.990000" : 305152
          }
        },
        "lat_ns" : {
          "min" : 11562,
          "max" : 310592,
          "mean" : 282464.258837,
          "stddev" : 4697.680408,
          "N" : 3169064
        },
        "bw_min" : 225373,
        "bw_max" : 227517,
        "bw_agg" : 100.000000,
        "bw_mean" : 226362.285714,
        "bw_dev" : 664.204953,
        "bw_samples" : 14,
        "iops_min" : 450746,
        "iops_max" : 455034,
        "iops_mean" : 452724.428571,
        "iops_stddev" : 1328.245153,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 31.300000,
      "sys_cpu" : 68.671429,
      "ctx" : 16,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 100.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999984,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.100000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.010000,
        "50" : 0.010000,
        "100" : 0.010000,
        "250" : 0.010000,
        "500" : 100.000473,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

io_uring-bdev_xnvme: (groupid=0, jobs=1): err= 0: pid=16334: Wed Oct 26 16:25:49 2022
  read: IOPS=453k, BW=221MiB/s (232MB/s)(1547MiB/7001msec)
    slat (nsec): min=1582, max=17573, avg=1749.83, stdev=232.49
    clat (usec): min=9, max=308, avg=280.71, stdev= 4.67
     lat (usec): min=11, max=310, avg=282.46, stdev= 4.70
    clat percentiles (usec):
     |  1.00th=[  277],  5.00th=[  277], 10.00th=[  277], 20.00th=[  277],
     | 30.00th=[  277], 40.00th=[  281], 50.00th=[  281], 60.00th=[  281],
     | 70.00th=[  281], 80.00th=[  281], 90.00th=[  289], 95.00th=[  293],
     | 99.00th=[  293], 99.50th=[  297], 99.90th=[  302], 99.95th=[  306],
     | 99.99th=[  306]
   bw (  KiB/s): min=225373, max=227517, per=100.00%, avg=226362.29, stdev=664.20, samples=14
   iops        : min=450746, max=455034, avg=452724.43, stdev=1328.25, samples=14
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=100.00%
  cpu          : usr=31.30%, sys=68.67%, ctx=16, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=3168937,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=221MiB/s (232MB/s), 221MiB/s-221MiB/s (232MB/s-232MB/s), io=1547MiB (1623MB), run=7001-7001msec